'''
build_dummy_data에서 사용
'''

# 성별 풀
gender_pool = [True, False]

# time
year_pool = [f"{i}" for i in range(2020,2026)]
get_len_2_int = [f"0{i}" for i in range(1,10)]
time_month2_pool = get_len_2_int + [f"{i}" for i in range(11,13)]
time_day2_pool = get_len_2_int + [f"{i}" for i in range(11,32)]
time_hour_pool = get_len_2_int[4:] + [f"{i}" for i in range(11,23)]

# 카드배송사
delivery_company_pool = ["국제", "제니엘시스템", "한승서비스", "성호라인"]

# 범죄
crime_name_pool = [
    "사기",
    "절도",
    "횡령",
    "배임",
    "강간",
    "폭행",
    "협박",
    "공갈",
    "업무상 과실치사",
    "모욕",
    "명예훼손",
    "모욕 및 명예훼손",
]

#  지검
prosecution_pool = [
    "서울중앙",
    "서울동부",
    "서울남부",
    "서울북부",
    "서울서부",
    "의정부",
    "인천",
    "춘천",
    "수원",
    "대전",
    "청주",
    "대구",
    "부산",
    "창원",
    "울산",
    "광주",
    "전주",
    "제주",
]

# 배송 점소
address_pool = {}
address_pool["서울강남"] = ["테헤란로", "언주로", "역삼로", "학동로", "도곡로", "자곡로","분당내곡로", "강남대로", "논현로"],
address_pool["서울서초"] = ["서초대로", "강남대로", "동작대로", "과천대로", "양재대로", "청계산로","도구로", "동광로", "명달로"]
address_pool["서울강동"] = ["양재대로", "조정대로", "올림픽대로", "올림픽로", "성내로", "천호대로","풍성로", "선사로", "명일로"]
address_pool["서울송파"] = ["성남대로", "송파대로", "가락로", "문정로", "석촌호수로", "잠실로","토성로", "충만로", "한가람로"]
address_pool["서울성북"] = ["종암로", "길음로", "동소문로", "성북로", "선잠로", "아리랑로","월곡로", "보문국로", "삼선교로"]
address_pool["서울종로"] = ["세종대로", "삼일대로", "필운대로", "동호로", "보문로", "무교로","새문안로", "수표로", "창경궁로"]
address_pool["서울중구"] = ["세종대로", "녹사평대로", "한강대로", "마장로", "청계천로", "을지로", "중림로", "수표로", "왕십리로"]
address_pool["대전서구"] = ["대덕대로", "도안대로", "둔산대로", "갈마로", "관저동로", "가수원로", "별곡로", "해천로", "둔산북로"]
address_pool["부산북구"] = ["의성로", "은행나무로", "상리로", "중리로", "만덕고개길", "가람로", "시랑로", "양달로", "용당로"]


